/***********************************************************
 * MCU 初始化 
 ***********************************************************/
#include "mcu_config.h"

/**********************************************************
 * 函数名：gpio_init
 * 描述  ：初始化gpio
 ******************************/
static void GpioInit(void)
{
	  FP00M = 0;
	  P0UR = 0;//////////////

	  P1M=0xfe;
	  P1UR=0x00;
	  P1=0x00;//////////////
	  P1W=0x01;

	  FP12M = 1;
	  FP13M = 1;
	  FP12 = 0;
	  FP13 = 0;

	  P2M=0xff;
	  P2=0x00;

	  P5M=0xff;
	  P5=0x10;
}

/*
 * 函数名：time_init
 * 描述  ：初始化time
 * 输入  ：无
 * 输出  ：无
 * 调用  ：外部调用
 */
static void TimerInit(void)
{
	  TC0R=206;     //(256-206)*2us=100us
	  TC0C=206;
	  TC0M=0xf4; 
}

/**********************************************
 * FunctionName: 初始化
 ************************/
void McuConfig(void)
{
	GpioInit();
	TimerInit();
}